# Settings Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Settings Properties
Settings Class See Also
---
The Settings type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Categories | Retrieves an object that provides access to all the categories contained in the Autodesk Revit application and project. |
| ElectricalSetting | Retrieves an object that provides access to all the electrical settings include voltage type, distribution system type, demand factor, wire type in the Autodesk Revit application and project. |
| IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |
| TilePatterns | Retrieves an object that provides access to the TilePattern objects in the document. |

# See Also
Settings Class
Autodesk.Revit.DB Namespace